[
  {
    "name": "Bilal Cinarli",
    "title": "Software Engineer at adidas, GDE on Web Technologies",
    "bio": "Bilal is a big enthusiast of building maintainable and scalable front-ends. To achieve this goal, he maintains open-source projects such as Caffeine, Melange, Misto and UX Rocket. In day-to-day works, he works on mobile web apps and JavaScript applications for intranets and as well as clients. He manages teams and optimizes the front-end development process. He is also, teaches HTML\/CSS and JavaScript techniques and gave workshops about Front-end related topics. He blogs at HTML Mag and share his thoughts about web development, mobile approaches.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/bilal.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/bcinarli",
      "github": "https:\/\/github.com\/bcinarli",
      "linkedin": "https:\/\/www.linkedin.com\/in\/bcinarli"
    },
    "sessions": [
      {
        "title": "Future Proof Frontend Coding: Decouple your dependencies",
        "description": "Almost every 6 months we have new frameworks or approaches in frontend world. Sometime your project’s codebase become outdated before it is on productions according to new techs. These rapid changes are tiring and frustrated for developers’ time to time. This talks helps to visualize how to setup your codebase for changes with wrapping your dependencies in a standardized way. So, your internal modules never aware of your external dependencies and even do not figure out if dependency changed or not at all. With the standardizing your wrappers, at any time you can update or change your external dependencies safely.",
        "keynote": 0,
        "day": 2,
        "track": 2,
        "session": 1,
        "time": "10:00",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Derick Rethans",
    "title": "Sr. Software Engineer at MongoDB, author of Xdebug",
    "bio": "Derick Rethans is a PHP internals expert, author of Xdebug and an OpenStreetMap and mapping enthusiast. He has contributed in a number of ways to the PHP project, including the Xdebug debugging tool, and various extensions and additions. He's a frequent lecturer at conferences, the author of php|architect's Guide to Date and Time Programming, and the co-author of PHP 5 Power Programming. He is now working at MongoDB, where he works on the PHP, C, and C++ drivers for MongoDB, and date\/time related server features.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/derick.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/derickr",
      "github": "https:\/\/github.com\/derickr",
      "linkedin": "https:\/\/www.linkedin.com\/in\/derickrethans"
    },
    "sessions": [
      {
        "title": "What's new in Xdebug?",
        "description": "In this talk I will cover the latest additions to Xdebug. Although it is 15 years old now, many features have been added in the last few months and years. In this talk, I will introduce and explain these new features, and some more notable features added in the last few years.",
        "keynote": 0,
        "day": 1,
        "track": 1,
        "session": 2,
        "time": "11:30",
        "language": "English"
      },
      {
        "title": "Introduction to PHP Extensions",
        "description": "You’ve got that need—the need for speed! Using step-by-step examples, we’ll take functions written in PHP and convert them into loadable extensions using C. We’ll then test both versions and compare the results. After seeing the size and scope of the benefits that can be realized with only a few minor changes, you’ll be ready to take the plunge. You’ll also understand why we start with simple things, and not try to rewrite all of Symfony in C.",
        "keynote": 0,
        "day": 1,
        "track": 1,
        "session": 6,
        "time": "16:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Emir Karsiyakali",
    "title": "Software Architect, PHP Evangelist",
    "bio": "Emir Karşıyakalı is Web developer with a passion for open-source, community & PHP. He is Zend Certified PHP Engineer and over 10 years of experience in web application development. User group leader of İstanbul PHP. Organizer of PHPKonf 2014, 2015, 2016 and 2017, Jstanbul 2012, JSIST 2014, Mobilist 2013, PHP-ist 2013, HackING Hackathon 2014 and much more.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/emir.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/emirkarsiyakali",
      "github": "https:\/\/github.com\/emir",
      "linkedin": "https:\/\/www.linkedin.com\/in\/emirkarsiyakali"
    },
    "sessions": [
      {
        "title": "PHP ile Defansif Programlama ve Statik Analiz",
        "description": "Oturumda 7.0 sürümüyle Gradual typing'e geçiş yapan PHP'in Defansif Programlama tarafında getirdikleri; hata derleme, soyutlama, calisthenics, değişmez objeler ve statik analiz anlatılarak uzun ömürlü ve özellikle açık kaynak projelerde uygulanması gereken bilgiler paylaşılacak.",
        "keynote": 0,
        "day": 2,
        "track": 2,
        "session": 5,
        "time": "15:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Ersoy Pembe",
    "title": "Sr. Software Developer at Insider",
    "bio": "Ersoy Pembe has been working as a senior software engineer and architect for Insider. He holds a BSc Computer Engineering degree from Koç University. Before joining Insider, he worked for InsightHealth (Germany), Mobven, Peak Games, and Positive. He is an expert at designing, developing and maintaining scalable systems.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/ersoy.jpg",
    "social": {
      "twitter": "#",
      "github": "https://github.com/ersoy-insider",
      "linkedin": "https://tr.linkedin.com/in/ersoy-pembe"
    },
    "sessions": [
      {
        "title": "Insider'da ayda 5 milyar Web Push bildirimini nasıl gönderiyoruz?",
        "description": "Insider'in kilit ürünlerinin başında \"Web Push Bildirimleri\" geliyor ve 350'den fazla müşteriye ayda 5 milyardan fazla bildirim gönderiyoruz. Bu sunumda ajandamız şu şekilde olacak; Web Push nedir ve ne gibi türleri vardır? Kullandığımız teknolojileri nasıl ölçeklendiriyoruz? Zamana karşı nasıl yarışıyor ve 1 dakikanın altında 5 milyon web push'u gönderiyoruz? PHP 7.1'e geçiş yaptığımızda ne gibi metriklerle karşılaştık? Oturumda bu soruları cevaplandırıyor olacağız.",
        "keynote": 0,
        "day": 1,
        "track": 2,
        "session": 2,
        "time": "12:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Fatih Kadir Akin",
    "title": "Full-stack Developer at Protel",
    "bio": "Ben Fatih Kadir Akın. 2000 yılından beri JavaScript geliştiriyorum. Yazılım hayatım boyunca JavaScript, PHP, Python, Ruby ve Crystal ile bir çok küçük ve büyük proje geliştirdim. Son zamanlarda profesyonel hayatıma Ruby, JavaScript/ECMAScript ve Crystal ile devam ediyorum. Daha önceden Hepsiburada, MetGlobal, Koding ve Markafoni'de JavaScript ve arayüz geliştirici olarak görev aldım. Şu an Protel Bilgisayar AŞ'de yazılım geliştirme ekibinde full-stack geliştirici olarak görev alıyorum. JavaScript İstanbul Topluluğu (Jstanbul)'nun kurucu ekibindenim. 2013 yılında Modern JavaScript kitabını yazdım.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/fatih.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/fkadev",
      "github": "https:\/\/github.com\/f",
      "linkedin": "https:\/\/www.linkedin.com\/in\/fatihkadirakin"
    },
    "sessions": [
      {
        "title": "GraphQL: Yeni Nesil Uygulama Geliştirme Arayüzleri",
        "description": "Facebook tarafından geliştirilen GraphQL teknolojisinin detaylarını, kullanım alanlarını ve PHP'de nasıl kullanılacağını anlatacağımız bir konuşma olacak.",
        "keynote": 0,
        "day": 2,
        "track": 2,
        "session": 3,
        "time": "12:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Filiz Altıntürk",
    "title": "Sr. Frontend Developer at Boyner Grup",
    "bio": "On yılı aşkın bir süredir dijital ajanslar ve kurumsal firmalar için Front-End teknolojileri geliştiriyorum. Son iki yıldır yüksek trafik alan web sitelerinin performans iyileştirmeleri konusunda araştırma ve geliştirmeler yapıyorum. Şu an Boyner'de Senior Front-End Developer olarak çalışmaktayım.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/filiz.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/Filiz_Altinturk",
      "github": "https:\/\/github.com\/filiz137",
      "linkedin": "https:\/\/www.linkedin.com\/in\/filizaltinturk"
    },
    "sessions": [
      {
        "title": "Front-end'in 1 saniyesi",
        "description": "Web siteleri için mobil uyumluluk ve performans artık bir tercih değil, zorunluluk. Gün geçtikçe artan internet kullanım oranları, özellikle de mobil cihazların göz ardı edilemeyecek yaygınlığı, tüm internet hızlarında ve tüm cihazlarda kullanıcı deneyimi geliştirmemiz konusunda bizi mecbur kılıyor. Hız ve performansın bu göz ardı edilemeyecek önemine karşın son birkaç yılda ortalama web sitelerinin boyutu üç katına çıktı ve birçok web tekniği ve platformu performansı göz ardı etti. Biten bataryalarımız, internet paketlerimiz ve sayfanın yüklenmesini beklerken yiten zamanlarımız oldu. Performans optimizasyonu şimdi yeni bir dalga, akım olarak karşımıza çıkar oldu. Bu sunumda kimler performans artışı için ne yaptı (NY Times ve BBC, Amazon ve tabi ki Nesine.com ), neler kazandı? Bunun için yapılabilecekler nelerdir Http/2, Service Workers, PWA, Resource Hints ve WebFont Performans konularında bu oturumda değiniyoruz.",
        "keynote": 0,
        "day": 1,
        "track": 2,
        "session": 6,
        "time": "17:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Gary Hockin",
    "title": "Sr. Software Engineer at BBC",
    "bio": "Gary travels all over the world empowering users of PhpStorm as a Developer Advocate for JetBrains (fine purveyors of quality IDEs). He is a talented and evocative speaker, a cultivated author of impressively entertaining blog posts, and records elegant and informative screencasts and videos. Gary's also a contributor to the Zend Framework and is argumentative enough to be on the community review team. When Gary had a real job, he was a developer of at least standard with nearly 20 years experience. When not developing, speaking about developing, reading about developing or writing about developing, Gary enjoys playing computer games, and arguing with his wife and two kids.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/gary.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/GeeH",
      "github": "https:\/\/github.com\/GeeH",
      "linkedin": "https:\/\/www.linkedin.com\/in\/gary-hockin-9b06863a\/"
    },
    "sessions": [
      {
        "title": "Things I Wish I Knew When I Started Playing \"Developer\"?",
        "description": "I'm a gamer, and some of my favourite articles to read about computer games are those click-bait posts that read \"Ten Things I Wish I Knew When I Started Playing Pac-Man!\". When you're playing computer games, it's easy to miss things that are obvious to others, and these posts can help you to understand a simple game mechanic that you'd otherwise have not used. It got me thinking about the things in my own career that I found out about too late, or didn't fully understand until much later than I needed it. We'll cover both the technical and the conversational, so join me, as I introduce you to Things I Wish I Knew When I Started Playing \"Developer\".",
        "keynote": 1,
        "day": 1,
        "track": 1,
        "session": 1,
        "time": "10:00",
        "language": "English"
      }
    ]
  },
  {
    "name": "Gulcin Yildirim Jelinek",
    "title": "SRE at 2ndQuadrant, Board Member on PostgreSQL EU",
    "bio": "Gülçin started working with PostgreSQL at a startup company in 2012 and was amazed how good Postgres really is! After being involved in organizing PostgreSQL conferences, giving talks and being an active community member she has been elected to PostgreSQL Europe Board in 2017. Gulcin is interested in PostgreSQL Automation and Cloud Technologies. She currently leads the Cloud service offerings at 2ndQuadrant as Site Reliability Engineer.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/gulcin.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/apatheticmagpie",
      "github": "https:\/\/github.com\/apatheticmagpie",
      "linkedin": "https:\/\/www.linkedin.com\/in\/gulcinyildirim"
    },
    "sessions": [
      {
        "title": "PostgreSQL is not your traditional SQL database",
        "description": "In this talk, we will discuss non-relational features of PostgreSQL such as JSONB datatype and full-text search. This will give you ideas about how to use PostgreSQL for modern software architectures.",
        "keynote": 0,
        "day": 2,
        "track": 1,
        "session": 3,
        "time": "12:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Hazel Kavili",
    "title": "Data Analyst at Wixot Games",
    "bio": "Hazel Kavılı studied Statistics (B.Sc. and M.Sc.) and she currently works at Wixot as Data Analyst. Besides work she also does her PhD in Earth System Sciences. She is also the founder of R-Ladies Istanbul chapter and member of NASADatanauts 2017 spring class.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/hazel.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/zofiathewitch",
      "github": "https:\/\/github.com\/UniversalTourist",
      "linkedin": "https:\/\/www.linkedin.com\/in\/hazzelkavili"
    },
    "sessions": [
      {
        "title": "Bir Veri Analistinin Web Geliştirme Maceraları",
        "description": "Veri biliminin ortaya çıkması ve büyük miktarda veriyi analiz etme, yorumlama gereksiniminin artmasıyla R dili daha popüler hale geldi. Bununla birlikte istatistiksel hesapların yapıldığı platformlar ve web arasında daha pürüzsüz bir etkileşime ihtiyaç duyulmaya başlandı. Veriyi daha etkileşimli bir kullanıcı arayüzü ile analiz edebilen uygulamalar geliştirmek ve bu uygulamaları cloud ortamında çalışır hale getirmek artık bir veri analistinin yaptığı işler arasında. R’ın Shiny paketi tam da bu durumlar için ideal bir araç. Veri bilimi alanında kadınların yerinden, global topluluklardan ve R-Ladies Istanbul’un bu topluluklar arasındaki yerinden bahsedilecek olan oturumda, R’ın Shiny uygulamaları ile birlikte bir veri analistinin web geliştirme maceralarını dinleyeceksiniz.",
        "keynote": 0,
        "day": 2,
        "track": 2,
        "session": 6,
        "time": "16:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Ismail Baskin",
    "title": "Google Cloud Developer Expert, Full-stack Developer",
    "bio": "Ismail Baskin is full stack developer for 12 years and has 2 years Google Cloud Services experience. He has been working as a freelancer developer and consultant.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/ismail.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/baskindev",
      "github": "https:\/\/github.com\/ismailbaskin",
      "linkedin": "https:\/\/www.linkedin.com\/in\/ismailbaskin"
    },
    "sessions": [
      {
        "title": "Google Cloud ile mükemmel PHP API'leri geliştirin",
        "description": "PHP uygulamanızı canlıya alırken yapmamız gereken bir çok şey var ama kodumuzu da karmaşıklıktan uzak tutmak istiyoruz. Kullanıcıları kimliklendirmek, yetkilendirmek, uygulamanın yavaş kısımlarını fark etmek, loglarını tutmak, sonrasında bu logları analiz etmek ve otomatik ölçeklendirmek gibi işleri bizim yerimize Google Cloud'un çözmesi için bilmeniz gereken şeyler bu sunumda.",
        "keynote": 0,
        "day": 2,
        "track": 2,
        "session": 4,
        "time": "14:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "James Titcumb",
    "title": "Consultant at Roave, maintainer of Zend Framework",
    "bio": "James is a consultant, trainer and developer at Roave. He is a prolific contributor to various open source projects and is a Zend Certified Engineer. He also founded the UK based PHP Hampshire user group and PHP South Coast conference.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/james.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/asgrim",
      "github": "https:\/\/github.com\/asgrim",
      "linkedin": "https:\/\/www.linkedin.com\/in\/jamestitcumb"
    },
    "sessions": [
      {
        "title": "Crafting Quality PHP Applications",
        "description": "This prototype works, but it's not pretty, and now it's in production. That legacy application really needs some TLC. Where do we start? When creating long lived applications, it's imperative to focus on good practices. The solution is to improve the whole development life cycle; from planning, better coding and testing, to automation, peer review and more. In this talk, we'll take a quick look into each of these areas, looking at how we can make positive, actionable change in our workflow.",
        "keynote": 0,
        "day": 1,
        "track": 1,
        "session": 3,
        "time": "12:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Jenny Wong",
    "title": "Community Engineer at Human Made",
    "bio": "Once a Web Developer, Jenny now works as a Community Engineer at Human Made. When she started, she spent her first two weeks organizing a conference. She can often be found evangelizing open source community, event organiser and occasionally, speaker. Her days are varied: From solving issues with event sites & supporting organisers, to passionately cheering people on to contribute back to their communities. She loves cooking up elaborate ideas to help improve participation experiences in open source projects. When away from the laptop, she’s usually binge watching Formula 1 & anime, doing house renovations or making a mess whilst cooking. You can find her on your messaging service of choice, making plenty of typos.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/jenny.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/miss_jwo",
      "github": "https:\/\/github.com\/missjwo",
      "linkedin": "https:\/\/www.linkedin.com\/in\/jenny-wong-0a37b526\/"
    },
    "sessions": [
      {
        "title": "Serve PHP Happily",
        "description": "The most common question or criticism about WordPress from PHP developers is: “When will WordPress finally increase their minimum PHP version?” In this talk Jenny will be sharing what WordPress has learnt from other PHP projects and how these lessons have informed the decision making and thought process of the WordPress efforts to upgrade. She will talk about the work being done with hosting providers, plugin authors and project Serve Happy. Come along to this talk if you want to find out what’s on the cards for the future of WordPress and what you can learn on how to handle these kind of situations for your projects.",
        "keynote": 0,
        "day": 2,
        "track": 1,
        "session": 6,
        "time": "16:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Juliette R. Folmer",
    "title": "Self-employed developer",
    "bio": "Juliette Reinders Folmer is an all round consultant and web-developer who tries not be a geek. Juliette is a long-standing member of PHPWomen which helped her immensely to find her feet in the PHP world. She is ZCE, actively contributes to a number of open source projects, has published several articles and speaks at conferences when given the chance. She loves it when you give her a chance to refactor spaghetti-code to something elegant and maintainable. Juliette is self-employed and based in the Netherlands.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/juliette.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/jrf_nl",
      "github": "https:\/\/github.com\/jrfnl",
      "linkedin": "https:\/\/www.linkedin.com\/in\/julietterf\/"
    },
    "sessions": [
      {
        "title": "Don't work for PHPCS, make PHPCS work for you",
        "description": "Congratulations! Your team has chosen a coding standard to use and you're well on your way to a consistent code style for all your projects. But... there are some extra things you'd like to check for, some rules you really can't be bothered with and some which sort of fit your needs, but not completely. Now what ? Come and learn how to make the PHP Codesniffer work for you and how to streamline the PHPCS related work-flow along the way.",
        "keynote": 0,
        "day": 2,
        "track": 1,
        "session": 4,
        "time": "14:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Lemi Orhan Ergin",
    "title": "Agile Software Craftsman at Craftbase",
    "bio": "Lemi Orhan Ergin has been working as Agile Software Craftsman and Agile Practice Lead at Craftbase. He completed his undergraduate and graduate degree in Computer Engineering department of Marmara University. He has been actively developing software since 2001. He has worked as software architect, software craftsman, technical leader, team leader, technical coordinator, Scrum Master and Agile coach in dozens of software projects at BYM, GittiGidiyor \/ eBay and Sony. As a managing partner in ACM, he has provided consulting services to dozens of companies. He has led the establishment of agile software cultures, continuity and sustainability in software teams. He has been sharing his experience about Agile \/ Scrum, Kanban, Management 3.0, Git, ALM Processes, TDD, Clean Code, Agile Engineering Practices and Software Craftsmanship with hundreds of professionals. He has been a national and international conference speaker. Slides of his talks has been displayed more than 1 million times on the Internet. He works voluntarily in software communities. He is the founder of the Software Craftsmanship Turkey community. He had been the leader of the community and the product owner of Agile Turkey Summit and CraftSummit conferences for two years.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/lemi.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/lemiorhan",
      "github": "https:\/\/github.com\/lemiorhan",
      "linkedin": "https:\/\/www.linkedin.com\/in\/lemiorhan"
    },
    "sessions": [
      {
        "title": "Temiz Kod Tasarımı",
        "description": "Programlama bir zanaat. Çıraklıktan ustalığa çıktığınız yolculuğunuzda sürekli geliştirdiğiniz bir hüner. Bu hüner, zaman içerisinde daha kaliteli kodların üretilmesini sağlamalı. Ancak günümüzde üretilen kodların kalitesinden sıklıkla şikayet etmemizden bu alanda çok da fazla aşama kaydetmediğimizi anlıyoruz. Bu konuda artık ciddi bir adım atmak zorundayız. Programlamanın temellerine inmeli, temiz kod tasarımı için gereken ortamı nasıl sağlayabileceğimizi konuşmalıyız. Bu oturumda Lemi bizlere temiz kod tasarımı yapabilmek için gereken adımlardan, çoğunlukla yanlış bilinen gerçeklerden ve bir yazılımcı için ustalaşmaya giden yolculuktan bahsedecek.",
        "keynote": 0,
        "day": 1,
        "track": 2,
        "session": 3,
        "time": "14:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Mark Baker",
    "title": "Lead Developer at Paybreak; author of PHPOffice",
    "bio": "Mark is Lead\/Senior Developer at Paybreak, a fintech company based in Altrincham near Manchester, UK. He has worked in the computer software industry since before symbolics.com was registered as a domain name, before \"cyberspace\" was first mentioned in fiction, when Linus Torvalds and Rasmus Lerdorf were still at high school, and Mrs. Zuckerberg had yet to give birth to a bouncing baby social network enabler; and has developed for the Web in many different languages since the days when the Tim Berners-Lee's creation comprised less than 1,000 sites. Over those years he has contributed to a number of open source projects: including a minor submission to PHP's SPL. Currently he is coordinator and lead developer for the PHPExcel library, and a coordinator and developer on the PHPOffice library suite. Most recently, he has been working on new datastructures such as Tries, Quadtrees and Matrices; hoping that he'll eventually be able to get them included in SPL. His particular interests include PHP integration with office suites, Generators, Textual analysis, Geodata and geographic information systems, and \"big data\" and data analysis.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/mark.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/Mark_Baker",
      "github": "https:\/\/github.com\/MarkBaker",
      "linkedin": "https:\/\/www.linkedin.com\/in\/mark-baker-171572b"
    },
    "sessions": [
      {
        "title": "Testing the Untestable",
        "description": "When we need to write unit tests for an existing codebase - particularly for older legacy code, or even for badly designed modern code - we sometimes come upon classes and methods that simply cannot be tested, or where the effort to write tests far exceeds the effort than it probably took to write the code in the first place. In this presentation we'll examine some of the \"code smells\" that make it difficult to write tests - and look at why they cause problems - before looking at the options available to make them testable.",
        "keynote": 0,
        "day": 2,
        "track": 1,
        "session": 1,
        "time": "10:00",
        "language": "English"
      }
    ]
  },
  {
    "name": "Mehmet Ince",
    "title": "Managing Partner at INVICTUS \/ PRODAFT",
    "bio": "Renowned as one of the leading figures of web application security, Mehmet İNCE's involvement with security dates back to the beginning of 2000s. Primarily working as a researcher regardless of his role and career in different organizations and companies, Mehmet has continued to publish new and interesting vulnerabilities on a wide variety of technology and infrastructures. In terms of his corporate life, INCE started his career as a penetration tester in various security companies during his junior college years. When he reached his senior year in Sakarya University, he has partnered up with his old-time friends for new security ventures. In the meantime, he has worked for Sony as a senior security engineer and penetration tester. When his own ventures started to flourish, he came back home and focused on building these fairly young and promising companies. Currently working as one of the managing partners of INVICTUS (one of the leading security companies of EMEA region) and PRODAFT SARL (a swiss-based Cyber Intelligence company); Mehmet continues to build and operate his team of skilled researchers. Despite his busy schedule, Mehmet also spends a considerable amount of time, sharing his experience and contributing to the security community by means of his articles on pentest.blog which he runs together with his team.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/mehmet.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/mdisec",
      "github": "https:\/\/github.com\/mmetince",
      "linkedin": "https:\/\/www.linkedin.com\/in\/mehmetdursunince"
    },
    "sessions": [
      {
        "title": "XSS Zafiyetinin Oluşumunu Anlamak ve Tarayıcı Güvenliği",
        "description": "Günümüz web uygulama güvenliği ile ilgili hususlar arasında yıllardır popülerliğini kaybetmeyen XSS zafiyetlerini anlamak tahmin edilenden çok daha zordur. Bu sunum içeriğinde, XSS zafiyetlerinin oluşum sürecine ve özel gerçek hayat örneklerine yer verilecektir. Ardından nihai olarak yazılım geliştiricilerin, uygulaması gereken metodolojiye değinilecektir.",
        "keynote": 0,
        "day": 1,
        "track": 2,
        "session": 5,
        "time": "16:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Michael Heap",
    "title": "Developer Advocate at Nexmo",
    "bio": "Michael is a polyglot software engineer, committed to reducing complexity in systems and making them more predictable. Working with a variety of languages and tools, he shares his technical expertise to audiences all around the world at user groups and conferences. Day to day, Michael is a developer advocate at Nexmo. He spends his time learning, teaching and writing about all kinds of technology. When not immersed in technology, you'll find him either playing various board games or hiking through the countryside.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/michael.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/mheap",
      "github": "https:\/\/github.com\/mheap",
      "linkedin": "https:\/\/www.linkedin.com\/in\/mheap"
    },
    "sessions": [
      {
        "title": "Behat for characterisation on tests",
        "description": "Once an API ships it doesn't matter how it should behave - how it actually behaves is the important part. Users depend on the existing behaviour and we need a way to ensure that it doesn't change Behat is a tool that was built to help design software, but it’s actually a great tool for capturing existing behaviour too. We’ve used these tools to gain confidence to refactor 5+ year old apps by capturing the existing behaviour before making changes. I want to share the secrets we learned with you.",
        "keynote": 0,
        "day": 1,
        "track": 1,
        "session": 7,
        "time": "17:30",
        "language": "English"
      },
      {
        "title": "Zero to Jenkins: Automatic builds + deploys",
        "description": "Jenkins has been one of the most popular continuous integration systems out there for many years. It was perfectly functional, but the UI wasn't the friendliest in the world and configuring jobs through a UI or XML files was just painful. In late 2016, Jenkins finally made it to version 2.0 which brought a huge number of improvements. From the new Blue Ocean UI to being able to define build configurations in your repo, it's a massive step up from version 1. In this talk, we'll go from an empty machine to a Jenkins install that automatically detects repos, branches and pull requests and builds them according to the Jenkinsfile in each branch. We'll be running tests, linting and packaging applications in parallel where possible, and even running things on Linux, Windows and MacOS all at the same time!",
        "keynote": 0,
        "day": 2,
        "track": 1,
        "session": 2,
        "time": "11:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Mustafa Ileri",
    "title": "R&D Team Lead at Zingat.com",
    "bio": "1983 İstanbul doğumluyum. Kocaeli Üniversitesi Elektrik Öğretmenliği mezunuyum. Yaklaşık olarak 13 yıldır profesyonel olarak yazılım geliştirme konusunda farklı pozisyonlarda çalışım. Favori programlama dillerim; PHP, Python. Bununla beraber kullanmayı sevdiğim frameworkler Symfony, Django, Flask. Web dünyasının yanında, son 1 yıldır data mining ve veri mühendisliği konuları üzerinde çalışıyorum.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/mustafa.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/mustafaileri",
      "github": "https:\/\/github.com\/mustafaileri",
      "linkedin": "https:\/\/www.linkedin.com\/in\/mustafaileri"
    },
    "sessions": [
      {
        "title": "PHP Projelerinde Test, CI ve CD Süreçleri",
        "description": "Bir PHP projesini testleri ile beraber Docker yardımı ile sanallaştırma ve izole ortamda çalıştırarak CI ve CD araçları ile build oluşturarak deployment gibi süreçleri otomatize etme süreçlerine değinilecek.",
        "keynote": 0,
        "day": 1,
        "track": 2,
        "session": 1,
        "time": "11:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Pascal Birchler",
    "title": "WordPress core committer",
    "bio": "Pascal is a student, software engineer, and public speaker based in Zurich, Switzerland. As a WordPress core committer he's a very active community member. Living in a multilingual country, Pascal has a keen interest in internationalization and localization.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/pascal.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/swissspidy",
      "github": "https:\/\/github.com\/swissspidy",
      "linkedin": "https:\/\/www.linkedin.com\/in\/swissspidy"
    },
    "sessions": [
      {
        "title": "On Internationalization and Localization",
        "description": "As developers, we try to follow best practices in our daily work. One such best practice is internationalization, a term that's used a lot in the ever globalizing world in which we live. However, it's often not fully understood or not used to its full extent. In this presentation, I'm going to explain the concept behind internationalization, localization, and their benefits. I will show how culture influences the user's behaviour and why we need to do more than just \"making things translatable\". For example, I18N is also about date formats, text direction, meaning of symbols, and even humor. Internationalization has a massive impact on user acceptance and usability. I will highlight existing tools, interfaces, and best practices to get I18N right in the UIs we create and the code we write.",
        "keynote": 0,
        "day": 2,
        "track": 1,
        "session": 5,
        "time": "15:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Philipp Krenn",
    "title": "Developer Advocate at Elastic",
    "bio": "Philipp is part of the infrastructure team and a developer advocate at Elastic. He is frequently talking about full-text search, databases, operations, and security. Additionally, he is organizing multiple meetups in Vienna.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/philipp.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/xeraa",
      "github": "https:\/\/github.com\/xeraa",
      "linkedin": "https:\/\/www.linkedin.com\/in\/xeraa"
    },
    "sessions": [
      {
        "title": "Monitoring of Your PHP Applications",
        "description": "\"Every outage is like a murder mystery\" is a common complaint. But it doesn't have to be! This talk gives an overview on how to monitor PHP applications from all possible sides. We dive into: * System metrics: Keep track of network traffic and system load. * Application metrics: Gather metrics of nginx or Apache, php-fpm, and MySQL. * Application logs: Collect logs in a structured format or parse them to extract all the relevant information. * Uptime monitoring: Ping services and actively monitor their availability and response time. And we will do all of that live since it is so easy and much more interactive that way.",
        "keynote": 0,
        "day": 1,
        "track": 1,
        "session": 5,
        "time": "15:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Tobias Nyholm",
    "title": "CTO at Happyr, Symfony core team",
    "bio": "Tobias is a software entrepreneur and have spent many years working within the web development ecosystem. He is organizer of Swedish PHP meetups, co-host of the Sound of Symfony podcast and a public speaker and Symfony core team member. He has written articles for php[architect], sitepoint and is a certified Symfony developer. Tobias is actively maintaining httplug.io, guzzle, buzz, php-geocoder, KnpGithub API client, Maingun API client, LinkedIn API client, Neo4j bundle and many more. He also writes a PSR for HTTP clients.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/tobias.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/tobiasnyholm",
      "github": "https:\/\/github.com\/Nyholm",
      "linkedin": "https:\/\/www.linkedin.com\/in\/tobiasnyholm"
    },
    "sessions": [
      {
        "title": "Deep dive into Symfony 4 internals",
        "description": "Symfony is a request and response framework. But what about all that magic that happens around your code? How does security work? Why isn’t autowring slowing things down? And how is it that symfony components can be so decoupled but sill play so well together? I will show you the symfony internals This talk will go over the architecture of Symfony. We will follow the request and the response paths throw the framework. We will do some stops at the components that are more awesome than others. This talk is perfect for you who been working with Symfony or Laravel before. But if you never touched a framework before, dont worry. You will still learn a lot from this talk.",
        "keynote": 0,
        "day": 1,
        "track": 1,
        "session": 4,
        "time": "14:30",
        "language": "English"
      }
    ]
  },
  {
    "name": "Yasemin Demiral",
    "title": "Researcher at Tübitak BİLGEM",
    "bio": "Yasemin DEMİRAL, Tübitak BİLGEM bünyesinde yer alan B3LAB (Bulut Bilişim ve Büyük Veri Lab.) da araştırmacı olarak çalışmaktadır. Lisansını Anadolu Üniversitesi’nde tamamlayarak Gazi Üniversitesi’nde yüksek lisansına devam etmektedir. ydemiral.blogspot.com isimli blog sitesi olup, fotografçılıkla ilgilenerek #byjasmin isimli instagram hesabından paylaşımlar yapmaktadır.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/yasemin.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/yasmindemiral",
      "github": "https:\/\/github.com\/yasmindemiral",
      "linkedin": "https:\/\/www.linkedin.com\/in\/ydemiral"
    },
    "sessions": [
      {
        "title": "Son Trend Konteyner Teknolojileri ve Bulut Bilişim",
        "description": "Sanallaştırma teknolojisi ile doğan bulut bilişim; son zamanların popüler teknolojisi konteynerlar; docker ve kubernetes. Temel olarak teknolojilerin açıklamaları, birbirleri ile ilişkileri, farkları, avantajları ve dezavantajlarını bu oturumda değerlendiriyoruz.",
        "keynote": 0,
        "day": 1,
        "track": 2,
        "session": 4,
        "time": "15:30",
        "language": "Türkçe"
      }
    ]
  },
  {
    "name": "Ziyahan Albeniz",
    "title": "Security Researcher at Netsparker",
    "bio": "1986 Istanbul. He graduated Computer Programming at Sakarya University. Works in Netsparker as a security researcher. He continues his work with mentorship of Ferruh Mavituna. He reported issues to alot of big company and he has been located these companies` hall of fame. His articles and researches is published on Netsparker Turkey Security Blog and he prepares and presents to his security podcast called Klavye Delikanlıları with Mustafa Yalcin.",
    "avatar": "https:\/\/phpkonf.org\/assets\/images\/speakers\/ziyahan.jpg",
    "social": {
      "twitter": "https:\/\/twitter.com\/ziyaxanalbeniz",
      "github": "https:\/\/github.com\/ziyahan",
      "linkedin": "https:\/\/www.linkedin.com\/in\/ziyahanalbeniz"
    },
    "sessions": [
      {
        "title": "OWASP Proactive Controls",
        "description": "Yazılım geliştiriciler, güvenli yazılım geliştirme ve Demokles'in Kılıcı gibi tepelerinde sallanan deadline kılıçlarıyla maalesef bu hususta yeterli performansı gösteremiyorlar. Kullanılan araçların, frameworklerin güvenlik duyarlılıkların zayıf olması ya da varsayılan olarak bu tedbirleri desteklemiyor oluşları da işin cabası. Sunumda özetle Proactive Controls maddelerini değerlendirecek ve Proactive Controls maddelerinin, OWASP Top 10 Kritik Zafiyetler Listesi'ndeki hangi derde deva olduğunu göreceğiz.",
        "keynote": 0,
        "day": 2,
        "track": 2,
        "session": 2,
        "time": "11:30",
        "language": "Türkçe"
      }
    ]
  }
]
